from telethon import events
from tigerMaf import app, MAFIA_GAME_BOT_USERNAME
from tigerMaf.decorators import check_user, check_block
from tigerMaf.filters import is_private
help_text1 = f"""🔥🎲 ثبت نام 🔥🎲

این ربات مخصوص پلیر های مافیا طراحی شده و وقتی شما پیام به کانال یا پیام خصوصی میدید بقیه اسمی که شما باهاش مافیا بازی میکنید رو میبینن نه اسم اکانت تلگرامتون
پس قبل از استفاده از قابلیت های ربات، ربات باید بدونه اسم مافیاتون چیه
برای این کار کافیه وارد ربات مافیا بشید 
{MAFIA_GAME_BOT_USERNAME}
دکمه پروفایل رو بزنید و پروفایل مافیاتون رو برای ربات فوروارد کنید ربات اسم و لیگ شما رو از اون پیامی که فوروارد کردید برمیداره و ذخیره میکنه به همین سادگی
آموزش تصویری ثبت نام کردن👇
/guideline

🔥🎲
🔥🎲🔥🎲
🔥🎲🔥🎲🔥🎲
🔥🎲🔥🎲🔥🎲🔥🎲"""

help_text2 = """📩 پیام خصوصی📩 :

وقتی که میخواید به یکی از پلیر های مافیا پیام خصوصی ارسال کنید از این قابلیت استفاده کنید
لیست کد پلیر های مافیا👇
/list
این لیست بهتون میگه که هر پلیر چه کدی داره
مثلا طبق همین لیست کد 3 مربوط به کاربری به نام ALI_TIGER و یا مثلا کد 1 مربوط به کاربری به نام  جهانبخش 
برای ارسال پیام به جهانبخش باید اول دکمه پیام خصوصی رو بزنید بعد ربات ازتون میپرسه که به کی میخواهید پیام خصوصی بدید، شما کد1 رو ارسال میکنید ربات متوجه میشه که میخواهید به  جهانبخش پیام خصوصی بدید و بعد پیام مورد نظرتون رو بنویسید
آموزش ویدیویی پیام خصوصی فرستادن👇
/guideline2


🎯✨
🎯✨🎯✨
🎯✨🎯✨🎯✨
🎯✨🎯✨🎯✨🎯✨"""

help_text3 = """🌐 پیام به کانال🌐 :

وقتی که میخواهید یک پیام به همه پلیر ها بدید از این دکمه استفاده کنید
اول دکمه رو بزنید بعد پیام، گیف یا استیکر، ویس، کلیپ ،عکس مورد نظرتون رو بفرستید
ربات اون پیام، گیف یا استیکر،ویس، کلیپ ، عکس  شما رو همراه با اسمتون در کانال قرار میده

🔥🪽
🔥🪽🔥🪽
🔥🪽🔥🪽🔥🪽
🔥🪽🔥🪽🔥🪽🔥🪽"""

help_text4 = """⭕️ دعوت: ربات بهتون یه لینک اختصاصی میده، هر کسی رو با اون لینک به ربات دعوت کردید و اون کاربر ثبت نام کرد 2سکه به پروفایل شما اضافه میشه
دریافت لینک اختصاصی👇
/link

🎲 جایزه روزانه 🎲: هر روز میتونید یک بار شانستون رو تو هر کدوم از بازی ها امتحان کنید و در صورت برنده شدن سکه به پروفایل شما اضافه میشه
در نهایت وقتی سکه های شما به 150 یا بیشتر رسید میتونید با زدن دکمه برداشت سکه، کوپن سکه خودتون رو دریافت کنید
مشاهده موجودی و برداشت سکه👇
/profile

⭕️افزایش موجودی با کوپن سکه: پایین پروفایل شما یک دکمه به نام واریز سکه وجود داره این دکمه رو بزنید و بعد کوپن سکه ارسال کنید، کوپن سکه هر مقداری که بود همون مقدار به پروفایل شما اضافه میشه 
پروفایل شما👇
/profile

اگه سوالی در مورد نحوه برداشت سکه و هر مورد دیگه ای داشتید تو قسمت پیام به ادمین بپرسید تا راهنماییتون کنم

🎳 💸
🎳 💸🎳 💸
🎳 💸🎳 💸🎳 💸
🎳 💸🎳 💸🎳 💸🎳 💸"""

help_text5 = """🎰 دوئل 🎰 :
تو این قسمت میتونید روی تاس و بسکتبال ، دارت  شرط‌بندی کنید در صورت گل شدن سکه شما ضربدر ضریب میشه و به پروفایل شما اضافه میشه

🎰💎
🎰💎🎰💎
🎰💎🎰💎🎰💎
🎰💎🎰💎🎰💎🎰💎"""

help_text6 = """❤️لایکی ❤️:
با این دکمه میتونید دوستاتونو لایک کنید 
هر جمعه ساعت 00:00 چهار نفر که بیشترین لایکو داشته باشن  کوپن سکه  میگیره

نفر اول 1000 یا 500💰

نفر دوم 450 یا 250💰

نفر سوم 250 یا 150 💰

نفر چهارم 150 یا 50💰

محدودیت های لایک کردن به این صورته👇
خودتونو نمیتونید لایک کنید
در یک روز میتونید 10 نفرو لایک کنید
در یک هفته  یک کاربرو یک بار میتونید لایک کنید

💰🤑
💰🤑💰🤑
💰🤑💰🤑💰🤑
💰🤑💰🤑💰🤑💰🤑"""
@app.on(events.NewMessage(incoming=True, pattern=r"🔍راهنما🔎|/help", func=lambda e: is_private(e)))
@check_user
async def help(event):
    await event.respond(help_text1)
    await app.send_file(event.chat_id, "tigerMaf/files/help/help1.jpg", caption=help_text2)
    await app.send_file(event.chat_id, "tigerMaf/files/help/help2.jpg", caption=help_text3)
    await event.respond(help_text4)
    await event.respond(help_text5)
    await event.respond(help_text6)

@app.on(events.NewMessage(incoming=True, pattern="/guideline4", func=lambda e: is_private(e)))
@check_user
async def sendbazi(event : events.NewMessage.Event):

    send_bazi_text = f"""در ربات دهات مافیا ( {MAFIA_GAME_BOT_USERNAME} )دکمه بازی دوستانه رو بزنید و بازی دوستانه رو یجا بفرستید(فرقی نمیکنه)
روی دکمه "پیوستن به بازی" نگه دارید(کلیک نکنید، نگه دارید) حالا میتونید لینک بازی دوستانه رو کپی کنید
و بعد میتونید همه جا(پیام همگانی یا پیام خصوصی) اون لینک بازی دوستانه رو ارسال کنید🤝"""

    await event.respond("https://t.me/TIGER_help1/23")
    await event.respond(send_bazi_text)
    return

@app.on(events.NewMessage(incoming=True, pattern="^/guideline$", func=lambda e : is_private(e)))
@check_user
async def saptnamgif(event : events.NewMessage.Event):
    await event.respond("https://t.me/TIGER_help1/25")
    return

@app.on(events.NewMessage(incoming=True, pattern="/guideline2", func=lambda e: is_private(e)))
@check_user
async def msgcodegif(event : events.NewMessage.Event):
    await event.respond("https://t.me/TIGER_help1/27")
    return

@app.on(events.NewMessage(incoming=True, pattern="/DUEL", func=lambda e: is_private(e)))
@check_user
async def cazino(event : events.NewMessage.Event):
    cazino_text = """🎰 دوئل 🎰 :

تو این بخش شما میتونید شرط بندی کنید. 
دکمه تاس رو بزنید، بعد مقدار سکه ای که میخواهید شرط بندی کنید رو بزنید، و بعد تاس بندازید
در صورت برنده شدن سکه ای که شرط بسته بودید ضرب در 2.7 میشه

💎🤑
💎🤑💎🤑
💎🤑💎🤑💎🤑
💎🤑💎🤑💎🤑💎🤑"""

    await event.respond(cazino_text)
    return

@app.on(events.NewMessage(incoming=True, pattern="/getcoin", func=lambda e: is_private(e)))
@check_user
async def getcoin(event : events.NewMessage.Event):
    get_coin_text = """⭕️دعوت: ربات بهتون یه لینک اختصاصی میده، هر کسی رو با اون لینک به ربات دعوت کردید و اون کاربر ثبت نام کرد 9 سکه به پروفایل شما اضافه میشه
دریافت لینک اختصاصی👇
/link

⭕️🎲جایزه روزانه🎲: هر روز میتونید یک بار شانستون رو تو هر کدوم از بازی ها امتحان کنید و در صورت برنده شدن سکه به پروفایل شما اضافه میشه
در نهایت وقتی سکه های شما به 25 یا بیشتر رسید میتونید با زدن دکمه برداشت سکه، کوپن سکه خودتون رو دریافت کنید
مشاهده موجودی و برداشت سکه👇
/profile

⭕️افزایش موجودی با کوپن سکه: پایین پروفایل شما یک دکمه به نام واریز سکه وجود داره این دکمه رو بزنید و بعد کوپن سکه ارسال کنید، کوپن سکه هر مقداری که بود همون مقدار به پروفایل شما اضافه میشه 
پروفایل شما👇
/profile

اگه سوالی در مورد نحوه برداشت سکه و هر مورد دیگه ای داشتید تو قسمت پیام به ادمین بپرسید تا راهنماییتون کنم"""

    await event.respond(get_coin_text)
    return
